[
  {
    "name": "David M.",
    "review": "The car quality was excellent and the service was excellent. I will definitely recommend this company. Thanks for the great service.",
    "date": "August 2024",
    "platform": "Turo"
  },
  {
    "name": "Stephanie L.",
    "review": "We really enjoyed our trip! and Jeff’s VW was amazing smooth and luxury all across the board 5 stars! Jeff was very fast in responding very professional and friendly! I will be renting from him again thank you Jeff again for your quick response.",
    "date": "March 2024",
    "platform": "Google"
  },
  {
    "name": "Teri M.",
    "review": "I recently rented a 2023 VW Tiguan through Turo. This SUV is AMAZING! It’s stylish & classy, the interior is sleek and comfortable, Bluetooth connectivity was a simple process. It has a panoramic roof which I love because all passengers can enjoy the view. Jeff was amazing, the vehicle was super clean and Jeff made the entire process a breeze. I would definitely rent again!",
    "date": "April 2024",
    "platform": "Google"
  },
  {
    "name": "Eric M.",
    "review": "Excellent service. Car was dropped in an easy to find location and was immaculate. The car was well maintained and operated perfectly. I couldn’t have been more pleased.",
    "date": "June 2024",
    "platform": "Google"
  },
  {
    "name": "Kelcie R.",
    "review": "I had the best experience with renting this car! The car was so clean and spotless, I am so thankful for the helpful hosts and responsiveness with my reservation. I would recommend this host to everyone and will definitely be renting again soon!",
    "date": "August 2024",
    "platform": "Turo"
  },
  {
    "name": "Kimberly A.",
    "review": "Pristine inside and out. The vehicle was spacious for each row and the trunk capacity was sufficient for our travels to the beach for 4 days. Jeff was easy to work with and had great communication, which helped me immensely being a first time user of TURO.",
    "date": "July 2024",
    "platform": "Turo"
  }
]
